# 面试题 08.11. 硬币
# 硬币。给定数量不限的硬币，币值为25分、10分、5分和1分，编写代码计算n分有几种表示法。(结果可能会很大，你需要将结果模上1000000007)
#
# 示例1:
#
#  输入: n = 5
#  输出：2
#  解释: 有两种方式可以凑成总金额:
# 5=5
# 5=1+1+1+1+1

class Solution(object):
    def waysToChange(self, n):
        mod = 10 ** 9 + 7

        coins = [25, 10, 5, 1]

        f = [1] + [0] * n
        for coin in coins:
            for i in range(coin, n + 1):
                f[i] += f[i - coin]
        return f[n] % mod

# coin : 25
# i : 25, 26, 27, 28, 29, 30
# f[25]=f[0] f[26]=f[1] f[27]=f[2] f[28]=f[3] f[29]=f[4] f[30]=f[5]

# coin : 10
# i : 10, 11, 12, 13, 14, 15, ... 30
# f[10] = f[0] f[11]=f[1] f[12]=f[2] ...